INSERT INTO USERS (EMAIL, FIRST_NAME, LAST_NAME, PASSWORD)
VALUES ('user@yandex.ru', 'User', 'UserLast', '{noop}password'),
       ('admin@javaops.ru', 'Admin', 'AdminLast', '{noop}admin');

INSERT INTO USER_ROLE (ROLE, USER_ID)
VALUES ('ROLE_USER', 1),
       ('ROLE_ADMIN', 2),
       ('ROLE_USER', 2);

INSERT INTO RESTAURANT (NAME, ADDRESS)
VALUES ('Макдоналдс', 'ул. Зеленая, 31'),
       ('Шаляпин', 'ул. Мира, 67'),
       ('Васаби', 'ул. Бумажная, д.20');

INSERT INTO LUNCH_REF (NAME, PRICE, DESCRIPTION, RESTAURANT_ID)
VALUES ('Филе-о-Фиш', 12700, 'треска, сыр чеддер, соус тар-тар, белый хлеб', 1),
       ('Чикенбургер', 5000, 'салат, курятина, панировочные сухари, белый хлеб', 1),
       ('Чикен Макнаггетс (20шт)', 27200, 'курятина, соус барбекю, горчица, кисло-сладкий соус, панировочные сухари, карри 20 шт', 1),
       ('Борщ с фасолью и чесночной пампушкой', 49000, NULL, 2),
       ('Рассольник по-шаляпински', 55000, NULL, 2),
       ('Шницель из телятины с квашеной капустой и печеным яблоком', 95000, NULL,2 ),
       ('Ролл Сочная креветка', 25700, 'креветка тигровая, краб-крем, огурец, сливочный сыр, икра масаго, шеф-соус, 207 г', 3),
       ('Ролл Огонь', 31700, 'лук зеленый, икра масаго, лосось, спайси соус, омлет томаго, угорь, сливочный сыр, 247 г', 3),
       ('Ролл Калифорния с цыпленком', 12900, 'акция, огурец, икра масаго, цыпленок копченый, сливочный сыр, 192 г', 3);


INSERT INTO MENU_ITEM (DATE, LUNCH_REF_ID)
VALUES (CURRENT_DATE, 1),
       (CURRENT_DATE, 4),
       (CURRENT_DATE, 6),
       ('2018-08-05', 1),
       ('2018-08-05', 2),
       ('2018-08-05', 3),
       ('2018-08-05', 4),
       ('2018-08-05', 5),
       ('2018-08-05', 6),
       ('2018-08-05', 7),
       ('2018-08-05', 8),
       ('2018-08-04', 2),
       ('2018-08-04', 5),
       ('2018-08-04', 8);

INSERT INTO VOTE (USER_ID, DATE, TIME)
VALUES (1, CURRENT_DATE, CURRENT_TIME),
       (1, '2018-08-07', '12:45:00'),
       (1, '2018-08-06', '10:25:00'),
       (1, '2018-08-05', '09:15:00'),
       (1, '2018-08-04', '15:55:00'),
       (1, '2018-08-03', '11:50:00'),
       (1, '2018-08-02', '11:51:00'),
       (1, '2018-08-01', '11:52:00'),
       (1, '2018-07-31', '11:53:00'),
       (1, '2018-07-30', '11:54:00'),
       (2, CURRENT_DATE, '07:00:00'),
       (2, '2018-08-06', '14:25:00'),
       (2, '2018-08-05', '08:15:00'),
       (2, '2018-08-04', '12:55:00'),
       (2, '2018-07-29', '11:25:00'),
       (2, '2018-07-28', '08:15:00'),
       (2, '2018-07-27', '12:55:00');
